damBreak/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
	turbulence on;
	
	LESModel Smagorinsky;
	
	printCoeffs on;
	
	delta cubeRootVol;
	
	SmagorinskyCoeffs
	{
		Ck	0.094;
		Ce	1.048;
	}
}



// ************************************************************************* //
